Pics/YCSB/level_ycsb.log
./leveldb/release/db_bench --cache_size=8388608 --logpath=/mnt/ssd --db=/mnt/nvm/level_ycsb --threads=4 --open_files=40000 --num=1500000000 --range=1500000000 --reads=2000000 --batch_size=1000 --stats_interval=1000000 --bloom_bits=10 --value_size=100 --histogram=true --log=true --benchmarks=loadreverse,ycsbc,ycsbb,ycsbd,ycsba,ycsbf,ycsbe,stats --ycsb_ops_num=8000000 --seek_nexts=100 --use_existing_db=true --print_wa=true --write_buffer_size=67108864 --max_file_size=67108864 
Keys:       16 bytes each
Values:     100 bytes each (50 bytes after compression)
Entries:    1500000000
RawSize:    165939.3 MB (estimated)
FileSize:   94413.8 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
FLAGS_num 1500000000, num_ 1500000000
num after by threads 375000000
loadreverse  : 90013148.000 micros/op 0 ops/sec;
Microseconds per op:
Count: 0 Average: 0.0000  StdDev: 0.00
Min: 0  Median: 0.0000  Max: 0
Percentiles: P50: 0.00 P75: 0.00 P99: 0.00 P99.9: 0.00 P99.99: 0.00
------------------------------------------------------

FLAGS_num 1500000000, num_ 375000000
num after by threads 375000000
2019/09/20-07:35:58  ... thread 3: (1000000,1000000) ops and (6494.4,6494.4) ops/second in (153.978548,153.978548) seconds
2019/09/20-07:35:58  ... thread 0: (1000000,1000000) ops and (6477.2,6477.2) ops/second in (154.387183,154.387183) seconds
2019/09/20-07:35:58  ... thread 1: (1000000,1000000) ops and (6469.3,6469.3) ops/second in (154.576341,154.576341) seconds
2019/09/20-07:35:59  ... thread 2: (1000000,1000000) ops and (6446.8,6446.8) ops/second in (155.115073,155.115073) seconds
2019/09/20-07:38:18  ... thread 3: (1000000,2000000) ops and (7146.8,6805.0) ops/second in (139.922178,293.900726) seconds
2019/09/20-07:38:18  ... thread 1: (1000000,2000000) ops and (7138.6,6787.5) ops/second in (140.084178,294.660519) seconds
2019/09/20-07:38:19  ... thread 2: (1000000,2000000) ops and (7137.9,6774.8) ops/second in (140.098035,295.213108) seconds
2019/09/20-07:38:19  ... thread 0: (1000000,2000000) ops and (7094.4,6771.8) ops/second in (140.955719,295.342902) seconds
2019/09/20-07:40:38  ... thread 3: (1000000,3000000) ops and (7142.2,6913.8) ops/second in (140.012650,433.913376) seconds
2019/09/20-07:40:39  ... thread 1: (1000000,3000000) ops and (7131.5,6898.4) ops/second in (140.223197,434.883716) seconds
2019/09/20-07:40:39  ... thread 2: (1000000,3000000) ops and (7137.1,6891.4) ops/second in (140.112470,435.325578) seconds
2019/09/20-07:40:39  ... thread 0: (1000000,3000000) ops and (7137.8,6889.5) ops/second in (140.099595,435.442497) seconds
2019/09/20-07:42:55  ... thread 3: (1000000,4000000) ops and (7277.5,7001.3) ops/second in (137.410519,571.323895) seconds
2019/09/20-07:42:56  ... thread 1: (1000000,4000000) ops and (7269.3,6987.5) ops/second in (137.565121,572.448837) seconds
2019/09/20-07:42:56  ... thread 2: (1000000,4000000) ops and (7276.4,6983.8) ops/second in (137.429654,572.755232) seconds
2019/09/20-07:42:57  ... thread 0: (1000000,4000000) ops and (7277.7,6982.6) ops/second in (137.406730,572.849227) seconds
2019/09/20-07:45:10  ... thread 3: (1000000,5000000) ops and (7397.2,7077.0) ops/second in (135.185773,706.509668) seconds
2019/09/20-07:45:11  ... thread 1: (1000000,5000000) ops and (7394.5,7065.3) ops/second in (135.235899,707.684736) seconds
2019/09/20-07:45:11  ... thread 2: (1000000,5000000) ops and (7392.4,7061.9) ops/second in (135.274339,708.029571) seconds
2019/09/20-07:45:12  ... thread 0: (1000000,5000000) ops and (7398.5,7062.0) ops/second in (135.163053,708.012280) seconds
2019/09/20-07:47:25  ... thread 3: (1000000,6000000) ops and (7418.0,7131.7) ops/second in (134.806711,841.316379) seconds
2019/09/20-07:47:26  ... thread 1: (1000000,6000000) ops and (7409.3,7120.4) ops/second in (134.965857,842.650593) seconds
2019/09/20-07:47:26  ... thread 2: (1000000,6000000) ops and (7413.7,7118.2) ops/second in (134.884896,842.914467) seconds
2019/09/20-07:47:27  ... thread 0: (1000000,6000000) ops and (7411.5,7118.0) ops/second in (134.925920,842.938200) seconds
2019/09/20-07:49:40  ... thread 3: (1000000,7000000) ops and (7417.1,7171.1) ops/second in (134.824106,976.140485) seconds
2019/09/20-07:49:41  ... thread 1: (1000000,7000000) ops and (7421.3,7161.9) ops/second in (134.746424,977.397017) seconds
2019/09/20-07:49:41  ... thread 2: (1000000,7000000) ops and (7412.8,7158.8) ops/second in (134.902034,977.816501) seconds
2019/09/20-07:49:41  ... thread 0: (1000000,7000000) ops and (7419.8,7159.6) ops/second in (134.775039,977.713239) seconds
2019/09/20-07:51:54  ... thread 3: (1000000,8000000) ops and (7474.3,7207.7) ops/second in (133.790993,1109.931478) seconds
2019/09/20-07:51:55  ... thread 1: (1000000,8000000) ops and (7470.0,7199.0) ops/second in (133.868378,1111.265395) seconds
2019/09/20-07:51:55  ... thread 2: (1000000,8000000) ops and (7469.1,7196.2) ops/second in (133.885757,1111.702258) seconds
2019/09/20-07:51:55  ... thread 0: (1000000,8000000) ops and (7467.5,7196.7) ops/second in (133.913123,1111.626362) seconds
ycsbc        :      34.745 micros/op 28780 ops/sec;    3.2 MB/s (8000000 of 8000000 found)
Microseconds per op:
Count: 32000000 Average: 138.8914  StdDev: 125.33
Min: 2  Median: 129.9088  Max: 86229
Percentiles: P50: 129.91 P75: 155.78 P99: 342.75 P99.9: 11586.60 P99.99: 29516.54
------------------------------------------------------
(       1,       2 ]        3   0.000%   0.000% 
(       2,       3 ]       16   0.000%   0.000% 
(       3,       4 ]       27   0.000%   0.000% 
(       4,       6 ]     3008   0.009%   0.010% 
(       6,      10 ]  1598102   4.994%   5.004% #
(      10,      15 ]  4758727  14.871%  19.875% ###
(      15,      22 ]   990984   3.097%  22.971% #
(      22,      34 ]   222550   0.695%  23.667% 
(      34,      51 ]    40482   0.127%  23.793% 
(      51,      76 ]     8482   0.027%  23.820% 
(      76,     110 ]  2222308   6.945%  30.765% #
(     110,     170 ] 18550564  57.971%  88.735% ############
(     170,     250 ]  2886301   9.020%  97.755% ##
(     250,     380 ]   558489   1.745%  99.500% 
(     380,     580 ]    71516   0.223%  99.724% 
(     580,     870 ]     5800   0.018%  99.742% 
(     870,    1300 ]     7140   0.022%  99.764% 
(    1300,    1900 ]     7301   0.023%  99.787% 
(    1900,    2900 ]     7552   0.024%  99.810% 
(    2900,    4400 ]     9833   0.031%  99.841% 
(    4400,    6600 ]     6844   0.021%  99.863% 
(    6600,    9900 ]     8822   0.028%  99.890% 
(    9900,   14000 ]     7655   0.024%  99.914% 
(   14000,   22000 ]    20451   0.064%  99.978% 
(   22000,   33000 ]     5624   0.018%  99.996% 
(   33000,   50000 ]      951   0.003%  99.999% 
(   50000,   75000 ]      453   0.001% 100.000% 
(   75000,  110000 ]       15   0.000% 100.000% 

FLAGS_num 1500000000, num_ 375000000
num after by threads 375000000
2019/09/20-07:53:47  ... thread 0: (1000000,1000000) ops and (9105.5,9105.5) ops/second in (109.824141,109.824141) seconds
2019/09/20-07:53:47  ... thread 1: (1000000,1000000) ops and (9121.3,9121.3) ops/second in (109.633883,109.633883) seconds
2019/09/20-07:53:47  ... thread 2: (1000000,1000000) ops and (9114.9,9114.9) ops/second in (109.710671,109.710671) seconds
2019/09/20-07:53:49  ... thread 3: (1000000,1000000) ops and (8977.1,8977.1) ops/second in (111.394218,111.394218) seconds
2019/09/20-07:55:30  ... thread 1: (1000000,2000000) ops and (9718.9,9410.6) ops/second in (102.892738,212.526621) seconds
2019/09/20-07:55:30  ... thread 2: (1000000,2000000) ops and (9706.4,9401.4) ops/second in (103.024629,212.735300) seconds
2019/09/20-07:55:32  ... thread 0: (1000000,2000000) ops and (9548.3,9321.6) ops/second in (104.731168,214.555309) seconds
2019/09/20-07:55:34  ... thread 3: (1000000,2000000) ops and (9514.8,9238.1) ops/second in (105.099464,216.493682) seconds
2019/09/20-07:57:38  ... thread 1: (1000000,3000000) ops and (7820.4,8813.2) ops/second in (127.870459,340.397080) seconds
2019/09/20-07:57:38  ... thread 2: (1000000,3000000) ops and (7810.2,8803.5) ops/second in (128.038015,340.773315) seconds
2019/09/20-07:57:40  ... thread 0: (1000000,3000000) ops and (7798.1,8751.7) ops/second in (128.235692,342.791001) seconds
2019/09/20-07:57:43  ... thread 3: (1000000,3000000) ops and (7750.3,8682.5) ops/second in (129.027569,345.521251) seconds
2019/09/20-07:59:52  ... thread 1: (1000000,4000000) ops and (7448.7,8427.3) ops/second in (134.252365,474.649445) seconds
2019/09/20-07:59:53  ... thread 2: (1000000,4000000) ops and (7450.9,8421.3) ops/second in (134.212715,474.986030) seconds
2019/09/20-07:59:55  ... thread 0: (1000000,4000000) ops and (7432.2,8379.7) ops/second in (134.550497,477.341498) seconds
2019/09/20-07:59:57  ... thread 3: (1000000,4000000) ops and (7446.3,8336.5) ops/second in (134.294244,479.815495) seconds
2019/09/20-08:02:06  ... thread 1: (1000000,5000000) ops and (7453.1,8212.6) ops/second in (134.172417,608.821862) seconds
2019/09/20-08:02:07  ... thread 2: (1000000,5000000) ops and (7446.1,8206.3) ops/second in (134.298968,609.284998) seconds
2019/09/20-08:02:09  ... thread 0: (1000000,5000000) ops and (7440.5,8173.4) ops/second in (134.398708,611.740206) seconds
2019/09/20-08:02:13  ... thread 3: (1000000,5000000) ops and (7378.7,8125.6) ops/second in (135.524490,615.339985) seconds
2019/09/20-08:04:21  ... thread 1: (1000000,6000000) ops and (7451.7,8075.2) ops/second in (134.196763,743.018625) seconds
2019/09/20-08:04:21  ... thread 2: (1000000,6000000) ops and (7438.6,8067.6) ops/second in (134.434493,743.719491) seconds
2019/09/20-08:04:23  ... thread 0: (1000000,6000000) ops and (7444.5,8042.2) ops/second in (134.327581,746.067787) seconds
2019/09/20-08:04:27  ... thread 3: (1000000,6000000) ops and (7438.7,8002.4) ops/second in (134.431397,749.771382) seconds
2019/09/20-08:06:34  ... thread 1: (1000000,7000000) ops and (7485.1,7985.2) ops/second in (133.598508,876.617133) seconds
2019/09/20-08:06:35  ... thread 2: (1000000,7000000) ops and (7483.2,7978.6) ops/second in (133.632102,877.351593) seconds
2019/09/20-08:06:37  ... thread 0: (1000000,7000000) ops and (7482.2,7957.1) ops/second in (133.651128,879.718915) seconds
2019/09/20-08:06:41  ... thread 3: (1000000,7000000) ops and (7479.3,7923.3) ops/second in (133.701750,883.473132) seconds
2019/09/20-08:08:49  ... thread 1: (1000000,8000000) ops and (7423.1,7910.4) ops/second in (134.715107,1011.332240) seconds
2019/09/20-08:08:49  ... thread 2: (1000000,8000000) ops and (7456.0,7909.3) ops/second in (134.120913,1011.472506) seconds
2019/09/20-08:08:51  ... thread 0: (1000000,8000000) ops and (7463.4,7891.8) ops/second in (133.987885,1013.706800) seconds
2019/09/20-08:08:55  ... thread 3: (1000000,8000000) ops and (7453.5,7861.3) ops/second in (134.165265,1017.638397) seconds
ycsbb        :      31.812 micros/op 31434 ops/sec;    3.5 MB/s (7600000 of 8000000 found)
Microseconds per op:
Count: 32000000 Average: 126.6922  StdDev: 124.07
Min: 1  Median: 127.9222  Max: 113156
Percentiles: P50: 127.92 P75: 153.92 P99: 284.37 P99.9: 5855.50 P99.99: 25048.70
------------------------------------------------------
[       0,       1 ]      116   0.000%   0.000% 
(       1,       2 ]     3503   0.011%   0.011% 
(       2,       3 ]    37186   0.116%   0.128% 
(       3,       4 ]   159303   0.498%   0.625% 
(       4,       6 ]   701041   2.191%   2.816% 
(       6,      10 ]   792680   2.477%   5.293% 
(      10,      15 ]  4794265  14.982%  20.275% ###
(      15,      22 ]  1170680   3.658%  23.934% #
(      22,      34 ]   165387   0.517%  24.451% 
(      34,      51 ]    22977   0.072%  24.522% 
(      51,      76 ]     5831   0.018%  24.541% 
(      76,     110 ]  2631507   8.223%  32.764% ##
(     110,     170 ] 18464863  57.703%  90.467% ############
(     170,     250 ]  2650962   8.284%  98.751% ##
(     250,     380 ]   301459   0.942%  99.693% 
(     380,     580 ]    36122   0.113%  99.806% 
(     580,     870 ]     4185   0.013%  99.819% 
(     870,    1300 ]     5583   0.017%  99.836% 
(    1300,    1900 ]     5926   0.019%  99.855% 
(    1900,    2900 ]     6141   0.019%  99.874% 
(    2900,    4400 ]     5763   0.018%  99.892% 
(    4400,    6600 ]     3809   0.012%  99.904% 
(    6600,    9900 ]     6423   0.020%  99.924% 
(    9900,   14000 ]     5452   0.017%  99.941% 
(   14000,   22000 ]    14771   0.046%  99.987% 
(   22000,   33000 ]     3121   0.010%  99.997% 
(   33000,   50000 ]       74   0.000%  99.997% 
(   50000,   75000 ]      826   0.003% 100.000% 
(   75000,  110000 ]       42   0.000% 100.000% 
(  110000,  170000 ]        2   0.000% 100.000% 

FLAGS_num 1500000000, num_ 375000000
num after by threads 375000000
2019/09/20-08:11:17  ... thread 3: (1000000,1000000) ops and (7213.5,7213.5) ops/second in (138.628365,138.628365) seconds
2019/09/20-08:11:17  ... thread 2: (1000000,1000000) ops and (7209.8,7209.8) ops/second in (138.700912,138.700912) seconds
2019/09/20-08:11:19  ... thread 1: (1000000,1000000) ops and (7216.3,7216.3) ops/second in (138.575409,138.575409) seconds
2019/09/20-08:11:22  ... thread 0: (1000000,1000000) ops and (7044.9,7044.9) ops/second in (141.947189,141.947189) seconds
2019/09/20-08:13:33  ... thread 3: (1000000,2000000) ops and (7385.1,7298.3) ops/second in (135.408610,274.036975) seconds
2019/09/20-08:13:33  ... thread 2: (1000000,2000000) ops and (7388.2,7297.9) ops/second in (135.351376,274.052288) seconds
2019/09/20-08:13:35  ... thread 1: (1000000,2000000) ops and (7353.4,7284.2) ops/second in (135.992222,274.567631) seconds
2019/09/20-08:13:37  ... thread 0: (1000000,2000000) ops and (7386.1,7211.5) ops/second in (135.389347,277.336536) seconds
2019/09/20-08:15:47  ... thread 3: (1000000,3000000) ops and (7458.1,7350.8) ops/second in (134.082915,408.119890) seconds
2019/09/20-08:15:47  ... thread 2: (1000000,3000000) ops and (7457.1,7350.2) ops/second in (134.100789,408.153077) seconds
2019/09/20-08:15:48  ... thread 1: (1000000,3000000) ops and (7466.5,7343.9) ops/second in (133.931983,408.499614) seconds
2019/09/20-08:15:51  ... thread 0: (1000000,3000000) ops and (7472.0,7296.3) ops/second in (133.833136,411.169672) seconds
2019/09/20-08:18:00  ... thread 2: (1000000,4000000) ops and (7493.7,7385.6) ops/second in (133.444563,541.597640) seconds
2019/09/20-08:18:00  ... thread 3: (1000000,4000000) ops and (7487.2,7384.4) ops/second in (133.560718,541.680608) seconds
2019/09/20-08:18:02  ... thread 1: (1000000,4000000) ops and (7498.6,7382.0) ops/second in (133.357532,541.857146) seconds
2019/09/20-08:18:04  ... thread 0: (1000000,4000000) ops and (7504.6,7347.2) ops/second in (133.251855,544.421527) seconds
2019/09/20-08:20:14  ... thread 2: (1000000,5000000) ops and (7501.5,7408.5) ops/second in (133.306236,674.903876) seconds
2019/09/20-08:20:14  ... thread 3: (1000000,5000000) ops and (7497.1,7406.7) ops/second in (133.384775,675.065383) seconds
2019/09/20-08:20:15  ... thread 1: (1000000,5000000) ops and (7512.2,7407.7) ops/second in (133.117351,674.974497) seconds
2019/09/20-08:20:17  ... thread 0: (1000000,5000000) ops and (7523.0,7381.7) ops/second in (132.926125,677.347652) seconds
2019/09/20-08:22:26  ... thread 2: (1000000,6000000) ops and (7550.3,7431.7) ops/second in (132.444444,807.348320) seconds
2019/09/20-08:22:26  ... thread 3: (1000000,6000000) ops and (7550.2,7430.2) ops/second in (132.446353,807.511736) seconds
2019/09/20-08:22:27  ... thread 1: (1000000,6000000) ops and (7560.8,7432.8) ops/second in (132.261423,807.235920) seconds
2019/09/20-08:22:29  ... thread 0: (1000000,6000000) ops and (7560.0,7410.9) ops/second in (132.275218,809.622870) seconds
2019/09/20-08:24:39  ... thread 2: (1000000,7000000) ops and (7535.5,7446.4) ops/second in (132.705786,940.054106) seconds
2019/09/20-08:24:39  ... thread 3: (1000000,7000000) ops and (7538.4,7445.5) ops/second in (132.654896,940.166632) seconds
2019/09/20-08:24:40  ... thread 1: (1000000,7000000) ops and (7527.4,7446.1) ops/second in (132.848726,940.084646) seconds
2019/09/20-08:24:42  ... thread 0: (1000000,7000000) ops and (7537.9,7428.7) ops/second in (132.663032,942.285902) seconds
2019/09/20-08:26:51  ... thread 3: (1000000,8000000) ops and (7545.0,7457.8) ops/second in (132.538243,1072.704875) seconds
2019/09/20-08:26:51  ... thread 2: (1000000,8000000) ops and (7536.2,7457.5) ops/second in (132.692149,1072.746255) seconds
2019/09/20-08:26:52  ... thread 1: (1000000,8000000) ops and (7559.3,7460.1) ops/second in (132.287362,1072.372008) seconds
2019/09/20-08:26:54  ... thread 0: (1000000,8000000) ops and (7552.0,7443.9) ops/second in (132.415410,1074.701312) seconds
ycsbd        :      33.621 micros/op 29743 ops/sec;    3.3 MB/s (7600000 of 8000000 found)
Microseconds per op:
Count: 32000000 Average: 134.1414  StdDev: 101.22
Min: 1  Median: 128.8018  Max: 106238
Percentiles: P50: 128.80 P75: 155.14 P99: 314.96 P99.9: 9928.89 P99.99: 27769.92
------------------------------------------------------
[       0,       1 ]      159   0.000%   0.000% 
(       1,       2 ]     4098   0.013%   0.013% 
(       2,       3 ]    34079   0.106%   0.120% 
(       3,       4 ]   142571   0.446%   0.565% 
(       4,       6 ]   668660   2.090%   2.655% 
(       6,      10 ]   920085   2.875%   5.530% #
(      10,      15 ]  4721104  14.753%  20.284% ###
(      15,      22 ]  1272916   3.978%  24.261% #
(      22,      34 ]   235032   0.734%  24.996% 
(      34,      51 ]    36018   0.113%  25.109% 
(      51,      76 ]     7739   0.024%  25.133% 
(      76,     110 ]  2246289   7.020%  32.152% #
(     110,     170 ] 18225681  56.955%  89.108% ###########
(     170,     250 ]  2977018   9.303%  98.411% ##
(     250,     380 ]   377331   1.179%  99.590% 
(     380,     580 ]    49147   0.154%  99.744% 
(     580,     870 ]     5739   0.018%  99.761% 
(     870,    1300 ]     7471   0.023%  99.785% 
(    1300,    1900 ]     7799   0.024%  99.809% 
(    1900,    2900 ]     8114   0.025%  99.835% 
(    2900,    4400 ]     7230   0.023%  99.857% 
(    4400,    6600 ]     5438   0.017%  99.874% 
(    6600,    9900 ]     8233   0.026%  99.900% 
(    9900,   14000 ]     6953   0.022%  99.922% 
(   14000,   22000 ]    19737   0.062%  99.983% 
(   22000,   33000 ]     4116   0.013%  99.996% 
(   33000,   50000 ]       19   0.000%  99.996% 
(   50000,   75000 ]     1156   0.004% 100.000% 
(   75000,  110000 ]       68   0.000% 100.000% 

FLAGS_num 1500000000, num_ 375000000
num after by threads 375000000
2019/09/20-08:28:15  ... thread 0: (1000000,1000000) ops and (12790.5,12790.5) ops/second in (78.182785,78.182785) seconds
2019/09/20-08:28:15  ... thread 1: (1000000,1000000) ops and (12735.2,12735.2) ops/second in (78.522516,78.522516) seconds
2019/09/20-08:28:18  ... thread 3: (1000000,1000000) ops and (12310.6,12310.6) ops/second in (81.231092,81.231092) seconds
2019/09/20-08:28:19  ... thread 2: (1000000,1000000) ops and (12262.6,12262.6) ops/second in (81.549036,81.549036) seconds
2019/09/20-08:29:35  ... thread 0: (1000000,2000000) ops and (12535.7,12661.9) ops/second in (79.771952,157.954737) seconds
2019/09/20-08:29:35  ... thread 1: (1000000,2000000) ops and (12594.5,12664.4) ops/second in (79.399933,157.922449) seconds
2019/09/20-08:29:39  ... thread 3: (1000000,2000000) ops and (12465.3,12387.5) ops/second in (80.222386,161.453478) seconds
2019/09/20-08:29:40  ... thread 2: (1000000,2000000) ops and (12324.4,12293.4) ops/second in (81.139819,162.688855) seconds
2019/09/20-08:30:55  ... thread 1: (1000000,3000000) ops and (12504.3,12610.6) ops/second in (79.972362,237.894811) seconds
2019/09/20-08:30:55  ... thread 0: (1000000,3000000) ops and (12474.8,12598.9) ops/second in (80.161575,238.116312) seconds
2019/09/20-08:30:59  ... thread 3: (1000000,3000000) ops and (12401.3,12392.1) ops/second in (80.637008,242.090486) seconds
2019/09/20-08:31:00  ... thread 2: (1000000,3000000) ops and (12514.0,12366.1) ops/second in (79.910469,242.599324) seconds
2019/09/20-08:32:15  ... thread 0: (1000000,4000000) ops and (12507.7,12576.0) ops/second in (79.950822,318.067134) seconds
2019/09/20-08:32:15  ... thread 1: (1000000,4000000) ops and (12446.6,12569.2) ops/second in (80.343332,318.238143) seconds
2019/09/20-08:32:19  ... thread 3: (1000000,4000000) ops and (12502.1,12419.4) ops/second in (79.986786,322.077272) seconds
2019/09/20-08:32:20  ... thread 2: (1000000,4000000) ops and (12487.3,12396.2) ops/second in (80.081238,322.680562) seconds
2019/09/20-08:33:34  ... thread 1: (1000000,5000000) ops and (12657.3,12586.7) ops/second in (79.005818,397.243961) seconds
2019/09/20-08:33:34  ... thread 0: (1000000,5000000) ops and (12550.7,12570.9) ops/second in (79.676919,397.744053) seconds
2019/09/20-08:33:38  ... thread 3: (1000000,5000000) ops and (12671.2,12468.9) ops/second in (78.918821,400.996093) seconds
2019/09/20-08:33:39  ... thread 2: (1000000,5000000) ops and (12669.3,12449.8) ops/second in (78.931193,401.611755) seconds
2019/09/20-08:34:52  ... thread 1: (1000000,6000000) ops and (12799.8,12621.7) ops/second in (78.126266,475.370227) seconds
2019/09/20-08:34:53  ... thread 0: (1000000,6000000) ops and (12674.3,12588.0) ops/second in (78.899871,476.643924) seconds
2019/09/20-08:34:56  ... thread 3: (1000000,6000000) ops and (12809.6,12524.5) ops/second in (78.066739,479.062832) seconds
2019/09/20-08:34:57  ... thread 2: (1000000,6000000) ops and (12814.9,12509.2) ops/second in (78.033915,479.645670) seconds
2019/09/20-08:36:09  ... thread 1: (1000000,7000000) ops and (12955.8,12668.4) ops/second in (77.185248,552.555475) seconds
2019/09/20-08:36:11  ... thread 0: (1000000,7000000) ops and (12902.4,12632.0) ops/second in (77.505256,554.149180) seconds
2019/09/20-08:36:13  ... thread 3: (1000000,7000000) ops and (12934.9,12581.5) ops/second in (77.310282,556.373114) seconds
2019/09/20-08:36:14  ... thread 2: (1000000,7000000) ops and (12956.4,12571.2) ops/second in (77.181869,556.827539) seconds
2019/09/20-08:37:26  ... thread 1: (1000000,8000000) ops and (12985.0,12707.1) ops/second in (77.012068,629.567543) seconds
2019/09/20-08:37:28  ... thread 0: (1000000,8000000) ops and (12964.2,12672.6) ops/second in (77.135619,631.284799) seconds
2019/09/20-08:37:30  ... thread 3: (1000000,8000000) ops and (13004.2,12632.8) ops/second in (76.898374,633.271488) seconds
2019/09/20-08:37:31  ... thread 2: (1000000,8000000) ops and (12978.8,12620.8) ops/second in (77.048882,633.876421) seconds
ycsba        :      19.819 micros/op 50455 ops/sec;    5.6 MB/s (4000000 of 8000000 found)
Microseconds per op:
Count: 32000000 Average: 79.0000  StdDev: 133.92
Min: 1  Median: 16.9119  Max: 108799
Percentiles: P50: 16.91 P75: 132.81 P99: 247.69 P99.9: 3649.14 P99.99: 21638.63
------------------------------------------------------
[       0,       1 ]      706   0.002%   0.002% 
(       1,       2 ]   109840   0.343%   0.345% 
(       2,       3 ]   879410   2.748%   3.094% #
(       3,       4 ]  2295819   7.174%  10.268% #
(       4,       6 ]  5868365  18.339%  28.607% ####
(       6,      10 ]  4205670  13.143%  41.749% ###
(      10,      15 ]  1781057   5.566%  47.315% #
(      15,      22 ]  3145581   9.830%  57.145% ##
(      22,      34 ]   828229   2.588%  59.733% #
(      34,      51 ]   131444   0.411%  60.144% 
(      51,      76 ]    20682   0.065%  60.209% 
(      76,     110 ]   902831   2.821%  63.030% #
(     110,     170 ] 10073876  31.481%  94.511% ######
(     170,     250 ]  1479137   4.622%  99.133% #
(     250,     380 ]   147486   0.461%  99.594% 
(     380,     580 ]    25584   0.080%  99.674% 
(     580,     870 ]    11746   0.037%  99.711% 
(     870,    1300 ]    15200   0.048%  99.758% 
(    1300,    1900 ]    18112   0.057%  99.815% 
(    1900,    2900 ]    19419   0.061%  99.876% 
(    2900,    4400 ]    15630   0.049%  99.924% 
(    4400,    6600 ]     4982   0.016%  99.940% 
(    6600,    9900 ]     3617   0.011%  99.951% 
(    9900,   14000 ]     3330   0.010%  99.962% 
(   14000,   22000 ]     9475   0.030%  99.991% 
(   22000,   33000 ]     2009   0.006%  99.998% 
(   33000,   50000 ]       36   0.000%  99.998% 
(   50000,   75000 ]      418   0.001%  99.999% 
(   75000,  110000 ]      309   0.001% 100.000% 

FLAGS_num 1500000000, num_ 375000000
num after by threads 375000000
2019/09/20-08:40:01  ... thread 1: (1000000,1000000) ops and (6746.6,6746.6) ops/second in (148.222870,148.222870) seconds
2019/09/20-08:40:02  ... thread 3: (1000000,1000000) ops and (6749.2,6749.2) ops/second in (148.165121,148.165121) seconds
2019/09/20-08:40:02  ... thread 0: (1000000,1000000) ops and (6743.3,6743.3) ops/second in (148.294917,148.294917) seconds
2019/09/20-08:40:02  ... thread 2: (1000000,1000000) ops and (6722.7,6722.7) ops/second in (148.750557,148.750557) seconds
2019/09/20-08:42:29  ... thread 1: (1000000,2000000) ops and (6778.4,6762.5) ops/second in (147.527880,295.750750) seconds
2019/09/20-08:42:29  ... thread 0: (1000000,2000000) ops and (6785.8,6764.5) ops/second in (147.366398,295.661315) seconds
2019/09/20-08:42:29  ... thread 2: (1000000,2000000) ops and (6784.1,6753.2) ops/second in (147.403547,296.154104) seconds
2019/09/20-08:42:30  ... thread 3: (1000000,2000000) ops and (6713.3,6731.2) ops/second in (148.958358,297.123479) seconds
2019/09/20-08:44:56  ... thread 1: (1000000,3000000) ops and (6807.4,6777.4) ops/second in (146.898843,442.649593) seconds
2019/09/20-08:44:56  ... thread 0: (1000000,3000000) ops and (6799.1,6776.0) ops/second in (147.079230,442.740545) seconds
2019/09/20-08:44:56  ... thread 2: (1000000,3000000) ops and (6808.1,6771.4) ops/second in (146.884108,443.038212) seconds
2019/09/20-08:44:57  ... thread 3: (1000000,3000000) ops and (6804.0,6755.3) ops/second in (146.972712,444.096191) seconds
2019/09/20-08:47:26  ... thread 1: (1000000,4000000) ops and (6652.7,6745.8) ops/second in (150.314451,592.964044) seconds
2019/09/20-08:47:26  ... thread 0: (1000000,4000000) ops and (6651.3,6744.4) ops/second in (150.346878,593.087423) seconds
2019/09/20-08:47:27  ... thread 2: (1000000,4000000) ops and (6649.4,6740.5) ops/second in (150.388488,593.426700) seconds
2019/09/20-08:47:27  ... thread 3: (1000000,4000000) ops and (6664.5,6732.4) ops/second in (150.049301,594.145492) seconds
2019/09/20-08:49:53  ... thread 1: (1000000,5000000) ops and (6798.2,6756.2) ops/second in (147.097838,740.061882) seconds
2019/09/20-08:49:54  ... thread 0: (1000000,5000000) ops and (6792.0,6753.8) ops/second in (147.232454,740.319877) seconds
2019/09/20-08:49:54  ... thread 2: (1000000,5000000) ops and (6779.3,6748.2) ops/second in (147.507003,740.933703) seconds
2019/09/20-08:49:55  ... thread 3: (1000000,5000000) ops and (6796.8,6745.1) ops/second in (147.128574,741.274066) seconds
2019/09/20-08:52:22  ... thread 1: (1000000,6000000) ops and (6727.4,6751.4) ops/second in (148.646609,888.708491) seconds
2019/09/20-08:52:22  ... thread 0: (1000000,6000000) ops and (6724.0,6748.9) ops/second in (148.720106,889.039983) seconds
2019/09/20-08:52:23  ... thread 2: (1000000,6000000) ops and (6715.7,6742.8) ops/second in (148.903825,889.837528) seconds
2019/09/20-08:52:23  ... thread 3: (1000000,6000000) ops and (6730.8,6742.8) ops/second in (148.570499,889.844565) seconds
2019/09/20-08:54:52  ... thread 1: (1000000,7000000) ops and (6668.9,6739.5) ops/second in (149.949443,1038.657934) seconds
2019/09/20-08:54:53  ... thread 0: (1000000,7000000) ops and (6655.9,6735.4) ops/second in (150.242722,1039.282705) seconds
2019/09/20-08:54:53  ... thread 3: (1000000,7000000) ops and (6668.6,6732.1) ops/second in (149.956112,1039.800677) seconds
2019/09/20-08:54:53  ... thread 2: (1000000,7000000) ops and (6658.8,6730.7) ops/second in (150.177163,1040.014691) seconds
2019/09/20-08:57:22  ... thread 1: (1000000,8000000) ops and (6642.9,6727.2) ops/second in (150.536219,1189.194153) seconds
2019/09/20-08:57:24  ... thread 3: (1000000,8000000) ops and (6649.3,6721.6) ops/second in (150.390763,1190.191440) seconds
2019/09/20-08:57:24  ... thread 2: (1000000,8000000) ops and (6642.0,6719.5) ops/second in (150.557384,1190.572075) seconds
2019/09/20-08:57:25  ... thread 0: (1000000,8000000) ops and (6571.5,6714.5) ops/second in (152.171652,1191.454357) seconds
ycsbf        :      37.239 micros/op 26853 ops/sec;    3.0 MB/s (8000000 of 8000000 found)
Microseconds per op:
Count: 32000000 Average: 148.7941  StdDev: 93.65
Min: 1  Median: 133.5054  Max: 120525
Percentiles: P50: 133.51 P75: 157.39 P99: 337.16 P99.9: 9047.96 P99.99: 27719.88
------------------------------------------------------
[       0,       1 ]       32   0.000%   0.000% 
(       1,       2 ]      411   0.001%   0.001% 
(       2,       3 ]      955   0.003%   0.004% 
(       3,       4 ]      915   0.003%   0.007% 
(       4,       6 ]     1633   0.005%   0.012% 
(       6,      10 ]    43400   0.136%   0.148% 
(      10,      15 ]  1520301   4.751%   4.899% #
(      15,      22 ]  3686094  11.519%  16.418% ##
(      22,      34 ]   688095   2.150%  18.568% 
(      34,      51 ]    75928   0.237%  18.806% 
(      51,      76 ]    11894   0.037%  18.843% 
(      76,     110 ]  2095912   6.550%  25.392% #
(     110,     170 ] 20100269  62.813%  88.206% #############
(     170,     250 ]  3215901  10.050%  98.255% ##
(     250,     380 ]   355360   1.111%  99.366% 
(     380,     580 ]    49623   0.155%  99.521% 
(     580,     870 ]    15099   0.047%  99.568% 
(     870,    1300 ]    19618   0.061%  99.630% 
(    1300,    1900 ]    21576   0.067%  99.697% 
(    1900,    2900 ]    21575   0.067%  99.764% 
(    2900,    4400 ]    20576   0.064%  99.829% 
(    4400,    6600 ]    12987   0.041%  99.869% 
(    6600,    9900 ]    13273   0.041%  99.911% 
(    9900,   14000 ]     6616   0.021%  99.931% 
(   14000,   22000 ]    16832   0.053%  99.984% 
(   22000,   33000 ]     3702   0.012%  99.996% 
(   33000,   50000 ]      124   0.000%  99.996% 
(   50000,   75000 ]      850   0.003%  99.999% 
(   75000,  110000 ]      448   0.001% 100.000% 
(  110000,  170000 ]        1   0.000% 100.000% 

FLAGS_num 1500000000, num_ 375000000
num after by threads 375000000
2019/09/20-09:01:19  ... thread 1: (1000000,1000000) ops and (4317.4,4317.4) ops/second in (231.622371,231.622371) seconds
2019/09/20-09:01:22  ... thread 0: (1000000,1000000) ops and (4249.3,4249.3) ops/second in (235.334865,235.334865) seconds
2019/09/20-09:01:24  ... thread 3: (1000000,1000000) ops and (4224.0,4224.0) ops/second in (236.740388,236.740388) seconds
2019/09/20-09:01:25  ... thread 2: (1000000,1000000) ops and (4198.9,4198.9) ops/second in (238.156510,238.156510) seconds
2019/09/20-09:05:23  ... thread 1: (1000000,2000000) ops and (4095.0,4203.2) ops/second in (244.199992,475.822363) seconds
2019/09/20-09:05:33  ... thread 0: (1000000,2000000) ops and (3989.2,4115.1) ops/second in (250.678541,486.013406) seconds
2019/09/20-09:05:34  ... thread 3: (1000000,2000000) ops and (3990.7,4104.1) ops/second in (250.582574,487.322962) seconds
2019/09/20-09:05:37  ... thread 2: (1000000,2000000) ops and (3971.3,4082.0) ops/second in (251.803832,489.960342) seconds
ycsbe        :      61.265 micros/op 16322 ops/sec;  171.6 MB/s (1899863 of 2000000 found)
Microseconds per op:
Count: 8000000 Average: 242.3899  StdDev: 447.55
Min: 2  Median: 238.3189  Max: 105564
Percentiles: P50: 238.32 P75: 328.18 P99: 570.59 P99.9: 3868.88 P99.99: 37038.46
------------------------------------------------------
(       1,       2 ]      209   0.003%   0.003% 
(       2,       3 ]     3013   0.038%   0.040% 
(       3,       4 ]    11661   0.146%   0.186% 
(       4,       6 ]    64696   0.809%   0.995% 
(       6,      10 ]   236501   2.956%   3.951% #
(      10,      15 ]    59499   0.744%   4.695% 
(      15,      22 ]   129695   1.621%   6.316% 
(      22,      34 ]   548135   6.852%  13.168% #
(      34,      51 ]   422999   5.287%  18.455% #
(      51,      76 ]   107266   1.341%  19.796% 
(      76,     110 ]    90121   1.127%  20.922% 
(     110,     170 ]  1196509  14.956%  35.879% ###
(     170,     250 ]  1322850  16.536%  52.414% ###
(     250,     380 ]  3004579  37.557%  89.972% ########
(     380,     580 ]   757916   9.474%  99.446% ##
(     580,     870 ]    30900   0.386%  99.832% 
(     870,    1300 ]     1515   0.019%  99.851% 
(    1300,    1900 ]     1282   0.016%  99.867% 
(    1900,    2900 ]     1554   0.019%  99.886% 
(    2900,    4400 ]     1703   0.021%  99.908% 
(    4400,    6600 ]     1043   0.013%  99.921% 
(    6600,    9900 ]     1267   0.016%  99.936% 
(    9900,   14000 ]      981   0.012%  99.949% 
(   14000,   22000 ]     1541   0.019%  99.968% 
(   22000,   33000 ]     1555   0.019%  99.987% 
(   33000,   50000 ]      884   0.011%  99.998% 
(   50000,   75000 ]      112   0.001% 100.000% 
(   75000,  110000 ]       14   0.000% 100.000% 

FLAGS_num 1500000000, num_ 375000000
num after by threads 375000000

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  2        0        0        27      587      4592
  3        0        0        30     6645      6626
  4      124     1029       396    85315     84668
  5     1632    99941      2966   598098    594705
  6     1050    67425      1620   319150    316716
WriteAmplification: inf